#ifndef MENU_HPP
#define MENU_HPP

#include "NcWrapper.hpp"

class Menu
{
public:
  enum class Option
  {
    Game,
    Scoreboard,
    Close,
    Menu,
  };

  Menu();

  Option getMenuOption();

private:
  Nc::Window m_mainWindow;

  static constexpr int s_titleLines{ 6 };
  static constexpr int s_titleLineLen{ 81 };
  static constexpr char* s_title[s_titleLines] =
  {
    "██████╗  ██████╗ ███╗   ███╗██████╗ ███████╗██████╗ ███╗   ███╗ █████╗ ███╗   ██╗",
    "██╔══██╗██╔═══██╗████╗ ████║██╔══██╗██╔════╝██╔══██╗████╗ ████║██╔══██╗████╗  ██║",
    "██████╔╝██║   ██║██╔████╔██║██████╔╝█████╗  ██████╔╝██╔████╔██║███████║██╔██╗ ██║",
    "██╔══██╗██║   ██║██║╚██╔╝██║██╔══██╗██╔══╝  ██╔══██╗██║╚██╔╝██║██╔══██║██║╚██╗██║",
    "██████╔╝╚██████╔╝██║ ╚═╝ ██║██████╔╝███████╗██║  ██║██║ ╚═╝ ██║██║  ██║██║ ╚████║",
    "╚═════╝  ╚═════╝ ╚═╝     ╚═╝╚═════╝ ╚══════╝╚═╝  ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝"
  };

  static constexpr int s_menuSize{ 3 };
  static constexpr char* s_menuOptions[s_menuSize]{
    "[      New game       ]",
    "[   Show scoreboard   ]",
    "[        Quit         ]"
  };

  static constexpr int s_authorsSize{ 3 };
  static constexpr char* s_authors[s_authorsSize] =
  {
    "Andrea Manzo",
    "Tommaso Lissandrin",
    "Alessandro Godani"
  };

};

#endif